# 开发时间：2024/3/22 12:47
"""
题目：采集一个人的身高, 体重, 年龄和性别; 告诉Ta, 自己的体脂率是否在正常范围之内

功能分析：
	1.输入： 身高 体重 年龄 性别
	2.数据处理： 计算体脂率 判定体脂率, 是否在正常的范围之内
	3.输出： 输出对应的结果 是否正常

体脂率计算公式:
	BMI = 体重（kg） / （身高 * 身高）（米）
	体脂率 = 1.2 * BMI + 0.23 * 年龄 - 5.4 - 10.8*性别（男：1 女：0）
	正常成年人的体脂率分别是男性15%~18%和女性25%~28%

知识考察点:
    注释
    输入输出
    变量使用
    变量的命名规范
    运算符的使用
    数据类型转换
"""
# 1.输入信息 获取数据
height=eval(input("请输入你的身高（米 | m）："))#eval将返回表达式里面的值，可以是float,也可以是int

weight=eval(input("请输入你的体重（千克| kg）："))

sex=eval(input("请输入你的性别（男1 女0）："))
age=eval(input("请输入你的年龄："))

# 2.计算
# BMI = 体重（kg） / （身高 * 身高）（米）
bmi=weight/(height*height)
# 体脂率 = 1.2 * BMI + 0.23 * 年龄 - 5.4 - 10.8 * 性别（男：1 女：0）
fatRate=1.2*bmi+0.23*age-5.4-10.8*sex
print("体脂率为：%.2f%%" %fatRate)

# 3.判断
# 正常成年人的体脂率分别是男性15 % ~18 % 和女性25 % ~28 %
# 方1（我的）：
# if(sex==1):
#     # print("hhhhhhhh")
#     if(15<=fatRate<=18):
#         print("您的体脂率处于正常范围之内")
#     else:
#         print("您的体脂率处于正常范围之外")
# else:
#     # print("oooooo")
#     if(25<=fatRate<=28):
#         print("您的体脂率处于正常范围之内")
#     else:
#         print("您的体脂率处于正常范围之外")

# 方2（原版|视频给的）：
minNum=0.15+0.1*(1-sex)#男1 女0
maxNUm=0.18+0.1*(1-sex)#女性比男性多0.1

result=minNum*100<=fatRate<=maxNUm*100
print("您的体脂率，是否符合标准：",result)