# 开发时间：2024/4/8 23:03
"""
数值的表现形式：
    整数int:二进制0b、八进制0o、十进制、十六进制0x
    浮点数float:整数部分+小数部分；可用科学计数法表示,如1.68e2-->1.68*10^2
    复数complex
注意：Python3的整型, 可以自动的调整大小, 当做Long类型使用，所以, Python3中, 没有Python2中的Long类型
"""

"""
x进制->十进制：
每位*相应的权重
"""
num=0o111
print(num)

num2=0b1101
print(num2)

"""
十进制->x进制：整除倒取余
"""
num3=18
print(bin(num3))#二进制
print(oct(num3))#八进制
print(hex(num3))#十六进制

"""
二进制->八进制：整合3位位1位，不够在前面补零
010 010
22
"""
num4=0b10010#8
print(oct(num4))
"""
二进制->十六进制：整合4位位1位，不够在前面补零
0001 0010
1 2
"""
num5=0b10010#8
print(hex(num5))
