# 开发时间：2024/4/23 11:05
"""----------------------------------------
函数速览：
ljust() rjust() center() lstrip() rstrip()
--------------------------------------------
"""


"""----------------------------------------
ljust
    作用
        根据指定字符(1个), 将原字符串填充够指定长度
        l:表示原字符串靠左
    语法
        ljust(width, fillchar)
    参数
        参数1-width
            指定结果字符串的长度
        参数2-fillchar
            如果原字符串长度 < 指定长度时
            填充过去的字符
    返回值
        填充完毕的结果字符串
    注意
        不会修改原字符串
        填充字符的长度为1
        只有原字符串长度 < 指定结果长度时才会填充
"""
name="wo shi sz"
print(name.ljust(12,'a'))
# print(name.ljust(12,'aa'))#×填充字符的长度为1
print(name)#不会修改原字符串
print(name.ljust(6,'a'))#只有原字符串长度 < 指定结果长度时才会填充

"""----------------------------------------
rjust
    作用
        根据指定字符(1个), 将原字符串填充够指定长度
        r
            表示原字符串靠右
    语法
        rjust(width, fillchar)
    参数
        参数1-width
            指定结果字符串的长度
        参数2-fillchar
            如果原字符串长度 < 指定长度时
            填充过去的字符
    返回值
        填充完毕的结果字符串
    注意
        不会修改原字符串
        填充字符的长度为1
        只有原字符串长度 < 指定结果长度时才会填充
center
    作用
        根据指定字符(1个), 将原字符串填充够指定长度
        center
            表示原字符串居中
    语法
        center(width, fillchar)
    参数
        参数1-width
            指定结果字符串的长度
        参数2-fillchar
            如果原字符串长度 < 指定长度时
            填充过去的字符
    返回值
        填充完毕的结果字符串
    注意
        不会修改原字符串
        填充字符的长度为1
        只有原字符串长度 < 指定结果长度时才会填充"""

name="wo shi sz"
print(name.rjust(12,'a'))
print(name.center(12,'a'))#表示原字符串居中

"""----------------------------------------
lstrip
    作用
        移除所有原字符串指定字符(默认为空白字符),\t \n 空格
        l
            仅仅只移除左侧的字符
    语法
        lstrip(chars)
    参数
        参数-chars
            需要移除的字符集
            表现形式为字符串
                "abc"
                表示,"a"|"b"|"c"
    返回值
        移除完毕的结果字符串
    注意
        不会修改原字符串
rstrip
    作用
        移除所有原字符串指定字符(默认为空白字符)
        r
            表示从右侧开始移除
    语法
        rstrip(chars)
    参数
        参数-chars
            需要移除的字符集
            表现形式为字符串
                "abc"
                表示,"a"|"b"|"c"
    返回值
        移除完毕的结果字符串
    注意
        不会修改原字符串
    填充压缩
--------------------------------------------
"""
name=" wo shi sz\t"
print("|"+name.lstrip()+"|")#移除了空格，\t在右侧，不移除
name="\nwo shi sz"
print("|"+name.lstrip()+"|")#移除了换行

name="wwo shi sz"
print("|"+name.lstrip("w")+"|")#移除左侧包含w的 |o shi sz|
name="wwo shi sz"
print("|"+name.lstrip("o")+"|")#在左边第一次字符没检测到o就返回了：|wwo shi sz|
name="wwo wshi sz"
print("|"+name.lstrip("wo")+"|")#移除左侧包含w和o的 | wshi sz|

# print(name)
